{
  "backend/main.mo": "Motoko actor that includes blob storage mixin and exposes a `getQuotes` query returning a hardcoded array of two philosophy quotes.",
  "feature_evidence.json": "Feature evidence report mapping two features (browsable quotes frontend and bold visual theme) to their implementing files, components, and test IDs.",
  "frontend-file-summaries.txt": "JSON document containing one-sentence summaries of each frontend source file for build planning reference.",
  "frontend/index.css": "Base Tailwind CSS file defining light and dark mode CSS custom properties using OKLCH color values for a neutral shadcn-style design system.",
  "frontend/index.html": "HTML entry point titled 'Cash's Famous Philosophy' that mounts the React app into a root div and loads the main TSX module.",
  "frontend/src/App.tsx": "Root app component that renders QuotesPage with a styled footer showing copyright year and a caffeine.ai attribution link with UTM tracking.",
  "frontend/src/components/QuoteCard.tsx": "Quote card component that displays a single quote with rotating wobble transforms, decorative quotation marks, an accent symbol, a numbered badge, and a fade-in-up animation.",
  "frontend/src/components/QuoteCardSkeleton.tsx": "Loading skeleton placeholder that mimics the QuoteCard layout using muted Skeleton blocks while quotes are being fetched.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and caches an ICP backend actor, using the current Internet Identity if authenticated, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hook for Internet Identity authentication, managing AuthClient lifecycle, login/logout, and exposing identity and login status to the component tree.",
  "frontend/src/hooks/useQueries.ts": "React Query hook `useGetQuotes` that fetches the philosophy quotes array from the backend actor via `getQuotes()` with a 5-minute stale time.",
  "frontend/src/index.css": "Global stylesheet importing Zilla Slab and Caveat fonts, defining a warm earthy OKLCH color palette, and adding utility classes for card wobble transforms, text shadows, and amber glow effects.",
  "frontend/src/main.tsx": "React app entry point that wraps the App component with QueryClientProvider and InternetIdentityProvider before mounting to the DOM.",
  "frontend/src/pages/QuotesPage.tsx": "React page component that fetches and displays Cash's philosophy quotes in a styled grid using QuoteCard components, with loading skeletons, error states, and a hero banner section.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom fonts (Zilla Slab, Caveat), an oklch-based color palette with warm espresso/cream/amber tones, and extended border radius and plugin settings.",
  "project_state.json": "Project state metadata describing the 'Cash's Famous Philosophy' app, its existing features (quote browsing UI and visual theme), pending feature requests (backend quote storage and seeding), and architectural notes."
}