{
  "backend/main.mo": "Motoko actor that includes a blob storage mixin and exposes a `getQuotes` query returning a hardcoded list of three humorous philosophical quotes.",
  "feature_evidence.json": "Feature evidence report mapping two implemented features—retry logic in `useGetQuotes` and skeleton-during-retry behavior in `QuotesPage.tsx`—to their source files, components, and test IDs.",
  "frontend-file-summaries.txt": "JSON document containing one-sentence summaries of each frontend source file, serving as a reference for the project's frontend structure and functionality.",
  "frontend/index.css": "Tailwind base stylesheet defining OKLCH CSS custom properties for light and dark color themes used throughout the app.",
  "frontend/index.html": "HTML entry point titled 'Cash's Famous Philosophy' that mounts the React app into a `#root` div via `src/main.tsx`.",
  "frontend/src/App.tsx": "Root React component that renders `QuotesPage` inside an `ErrorBoundary` and always displays a `Footer` with a caffeine.ai attribution link.",
  "frontend/src/components/ErrorBoundary.tsx": "Class-based React error boundary that catches render errors and displays a themed fallback UI with a 'Try again' button to reset the error state.",
  "frontend/src/components/QuoteCard.tsx": "Presentational component that renders a single `Quote` as a styled card with decorative quotation marks, a numbered badge, accent symbols, and wobble animation.",
  "frontend/src/components/QuoteCardSkeleton.tsx": "Loading placeholder component that renders skeleton blocks styled to match the `QuoteCard` layout while quotes are being fetched.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and caches an authenticated or anonymous ICP backend actor, invalidating dependent queries whenever the identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hook for Internet Identity authentication, exposing login/logout functions, identity state, and login status derived from `@dfinity/auth-client`.",
  "frontend/src/hooks/useQueries.ts": "React Query hook `useGetQuotes` that fetches quotes from the backend actor with 3 retries and exponential backoff (up to 30s) to handle intermittent failures.",
  "frontend/src/index.css": "Global CSS file that imports Google Fonts (Zilla Slab, Caveat), sets up Tailwind directives, defines a warm earthy OKLCH color palette via CSS variables, and adds utility classes for fonts, card wobble animations, and quote cycling transitions.",
  "frontend/src/main.tsx": "React app entry point that wraps the App component with QueryClientProvider (React Query) and InternetIdentityProvider before mounting to the DOM.",
  "frontend/src/pages/QuotesPage.tsx": "Page component that fetches and displays cycling philosophical quotes with fade transitions, dot indicators, and skeleton/error states; shows skeleton during loading/retries and only shows the error UI after all retries are exhausted.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the theme with custom OKLCH-based color tokens (amber, cream, espresso, sidebar, chart), slab/handwritten font families, border radius variants, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state metadata describing the app (cycling quotes display), tracking two implemented features—auto-retry with exponential backoff in useGetQuotes and skeleton-during-retry behavior in QuotesPage—to fix intermittent mobile quote loading failures."
}