{
  "backend/main.mo": "Motoko actor that includes a blob storage mixin and exposes a `getQuotes` query returning a hardcoded list of four humorous philosophical quotes.",
  "feature_evidence.json": "Feature evidence report file with an empty features array, indicating no features have been recorded yet.",
  "frontend-file-summaries.txt": "JSON document containing one-sentence summaries of each frontend source file, serving as a reference for the project's frontend structure.",
  "frontend/index.css": "Base Tailwind CSS file defining OKLCH-based CSS custom properties for light and dark color themes including sidebar, chart, and UI element tokens.",
  "frontend/index.html": "HTML entry point for the app titled 'Cash's Famous Philosophy' that mounts the React app into a root div via the main.tsx module script.",
  "frontend/src/App.tsx": "Root React component that renders `QuotesPage` inside an `ErrorBoundary` and always displays a `Footer` with a caffeine.ai attribution link.",
  "frontend/src/components/ErrorBoundary.tsx": "Class-based React error boundary that catches render errors and displays a themed fallback UI with an optional dev-mode error message and a 'Try again' reset button.",
  "frontend/src/components/QuoteCard.tsx": "Presentational component that renders a single quote as a styled card with decorative quotation marks, wobble transforms, accent symbols, and a numbered badge.",
  "frontend/src/components/QuoteCardSkeleton.tsx": "Loading skeleton placeholder component for quote cards using themed skeleton blocks to maintain layout during data fetching.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and caches an authenticated or anonymous ICP backend actor, invalidating dependent queries whenever the actor instance changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Internet Identity authentication hook and provider that manages AuthClient lifecycle, login/logout state, and exposes identity context to the component tree.",
  "frontend/src/hooks/useQueries.ts": "React Query hook `useGetQuotes` that fetches quotes from the backend actor once it is available, with 3 retries and exponential backoff up to 30 seconds.",
  "frontend/src/index.css": "Main CSS file importing Zilla Slab and Caveat fonts, defining a warm earthy OKLCH color palette, card wobble transforms, text shadow utilities, and quote cycling transition classes.",
  "frontend/src/main.tsx": "React app entry point that wraps the `App` component with `QueryClientProvider` and `InternetIdentityProvider` before mounting to the DOM.",
  "frontend/src/pages/QuotesPage.tsx": "React page that fetches and displays quotes in a cycling carousel with fade transitions, dot indicators, and skeleton/error/empty states.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom fonts (Zilla Slab, Caveat), an oklch-based color palette (amber, cream, espresso), and extended border radius/container settings.",
  "project_state.json": "Project state tracking document recording known backend connectivity issues and pending action items including fixing the IC agent host URL and adding new hardcoded quotes to the backend canister."
}