{
  "backend/main.mo": "Motoko actor that includes a blob storage mixin and exposes a `getQuotes` query returning a hardcoded list of four humorous philosophical quotes.",
  "feature_evidence.json": "Empty feature evidence report JSON file with no recorded features.",
  "frontend-file-summaries.txt": "JSON document containing short descriptions of each frontend source file, serving as a reference summary of the frontend codebase.",
  "frontend/index.css": "Base Tailwind CSS file defining OKLCH-based CSS custom properties for light and dark themes including colors, borders, and chart variables.",
  "frontend/index.html": "HTML entry point for the app titled 'Cash's Famous Philosophy' that mounts the React app via a root div and loads the main TSX module.",
  "frontend/src/App.tsx": "Root React component that renders `QuotesPage` inside an `ErrorBoundary` with a persistent `Footer` containing a caffeine.ai attribution link.",
  "frontend/src/components/ErrorBoundary.tsx": "Class-based React error boundary that catches render errors and displays a warm earthy fallback UI with a 'Try again' button; shows error details in dev mode.",
  "frontend/src/components/QuoteCard.tsx": "Styled article component that renders a single `Quote` with decorative quotation marks, wobble transforms, accent symbols, a numbered badge, and a Cash attribution footer.",
  "frontend/src/components/QuoteCardSkeleton.tsx": "Loading skeleton placeholder for a quote card using themed `Skeleton` blocks to maintain layout during data fetching.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and caches an authenticated or anonymous ICP backend actor, invalidating dependent queries whenever the actor instance changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Internet Identity authentication hook and provider that manages AuthClient lifecycle, login/logout state, and exposes identity context to child components.",
  "frontend/src/hooks/useQueries.ts": "React Query hook `useGetQuotes` that fetches quotes from the backend actor once available, with 3 retries and exponential backoff up to 30 seconds.",
  "frontend/src/index.css": "Main CSS file importing Zilla Slab and Caveat fonts, defining a warm earthy OKLCH color palette, card wobble transforms, text shadow utilities, and quote cycling transition classes.",
  "frontend/src/main.tsx": "React app entry point that wraps `App` with `QueryClientProvider` and `InternetIdentityProvider` before mounting to the DOM.",
  "frontend/src/pages/QuotesPage.tsx": "React page that fetches and displays quotes in a cycling carousel with fade transitions, dot indicators, and skeleton/error/empty states.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom fonts (Zilla Slab, Caveat), an oklch-based warm color palette (amber, cream, espresso), and extended border radius/container settings.",
  "project_state.json": "Project state tracker documenting known issues (backend unreachable on all platforms, quotes disappearing after deployment) and pending action items to fix canister connectivity and ensure all quotes persist in main.mo."
}