{
  "kind": "build_request",
  "title": "Cash's Famous Philosophy App",
  "projectName": "Cash's Philosophy",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Store a collection of Cash's philosophy quotes in the backend. Seed it with at least these two quotes: 'If an orange is called an orange, why is an apple not called a red?' and 'Your tongue knows what everything tastes like.' Support querying all quotes.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-2"
        ],
        "quotes": [
          "If an orange is called an orange, why is an apple not called a red?",
          "Your tongue knows what everything tastes like."
        ]
      },
      "acceptanceCriteria": [
        "Backend stores at least the two example quotes.",
        "A query function returns the full list of quotes.",
        "Data persists across canister upgrades."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Build a browsable frontend that displays Cash's philosophy quotes fetched from the backend. Each quote should be presented as its own card or panel. Users can scroll or navigate through the collection.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-2"
        ],
        "quotes": [
          "Create an app for Cash's famous philosophy."
        ]
      },
      "acceptanceCriteria": [
        "All quotes from the backend are displayed on screen.",
        "Each quote is visually distinct in its own card or panel.",
        "The layout is scrollable or paginated when there are many quotes.",
        "The two example quotes appear in the collection."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Apply a bold, irreverent visual theme — think late-night diner meets philosophical manifesto. Use warm, earthy tones (amber, cream, deep brown) with chunky serif or slab typography, hand-drawn-style accents, and a slightly chaotic but charming layout that matches the absurdist humor of the quotes. Enforce this style consistently across all pages and components.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-2"
        ]
      },
      "acceptanceCriteria": [
        "Color palette uses warm earthy tones (amber, cream, deep brown) with no blue or purple.",
        "Typography uses a bold serif or slab font that feels expressive.",
        "Visual style is consistent across the entire app.",
        "The design complements the humorous, absurdist tone of the quotes."
      ]
    }
  ],
  "constraints": [
    "Do not add user authentication or login.",
    "Do not allow users to submit their own quotes in this version."
  ],
  "nonGoals": [
    "User-generated quote submission.",
    "Social sharing or voting on quotes.",
    "Search or filtering of quotes."
  ],
  "imageRequirements": {
    "required": [
      "A quirky hand-drawn style banner illustration featuring abstract swirling thought bubbles, question marks, fruits (orange and apple), and a tongue, rendered in warm amber and cream tones on a deep brown background (philosophy-banner.dim_1200x300.png)"
    ],
    "edits": []
  }
}