{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Auto-retry quote loading on mobile failure",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Configure automatic retry logic in the useGetQuotes hook with exponential backoff to handle intermittent mobile loading failures without user intervention",
      "acceptanceCriteria": [
        "When the initial quote fetch fails, the hook automatically retries at least 3 times before giving up",
        "Retries use a backoff strategy (e.g., increasing delay between attempts)",
        "The loading/skeleton state remains visible during retry attempts rather than showing the error screen",
        "The 'wisdom got lost in thought' error screen is only shown after all retries are exhausted",
        "On mobile, if quotes fail on first load but succeed on a subsequent retry, quotes display normally without user interaction"
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Update the useGetQuotes hook to add React Query retry configuration with at least 3 retry attempts and exponential backoff delay (e.g., retryDelay: attemptIndex => Math.min(1000 * 2 ** attemptIndex, 30000)). Configure retry to true or specify retry count (e.g., retry: 3). Ensure the hook continues to guard against null actor and properly returns isLoading status during retries."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Maintain skeleton loading UI during retry attempts in QuotesPage, only showing the error screen after all retries are exhausted",
      "acceptanceCriteria": [
        "The skeleton loading UI is shown while retries are in progress",
        "The error UI ('wisdom got lost in thought') is only displayed once all retry attempts have been exhausted",
        "No regression on desktop — behavior remains the same for successful loads"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/QuotesPage.tsx",
          "operation": "modify",
          "description": "Update the error handling logic to keep displaying the QuoteCardSkeleton components while isLoading is true (which remains true during React Query retry attempts). Only render the error UI ('wisdom got lost in thought') when isError is true AND isLoading is false, indicating all retry attempts have been exhausted. Ensure the loading skeleton array rendering continues during the retry phase without switching to error state prematurely."
        }
      ]
    }
  ]
}